# Don't forget to install brew tap Homebrew/bundle

# specify a directory to install
cask_args appdir: '/Applications'
# install packages
tap "homebrew/bundle"
tap "homebrew/cask" || true
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"

brew "autojump"
brew "bash-completion"
brew "gh"
brew "git"
brew "htop"
brew "mas"
brew "node"
brew "speedtest-cli"
brew "tree"
brew "wget"
brew "zsh"
brew "zsh-syntax-highlighting"

cask "docker"
cask "droplr"
cask "font-fira-code"
cask "google-chrome"
cask "iterm2"
cask "microsoft-auto-update"
cask "microsoft-edge"
cask "rectangle"
cask "skype"
cask "slack"
cask "spotify"
cask "vanilla"
cask "visual-studio-code"
cask "whatsapp"

mas 'Parallel Desktops', id: 1085114709
mas 'Times', id: 1048770312
mas 'HP Smart', id: 1474276998