# Don't forget to install brew tap Homebrew/bundle

# specify a directory to install
cask_args appdir: '/Applications'
# install packages
tap 'homebrew/cask' || true
brew 'git'
brew 'gh'
brew 'bash-completion'
brew 'tree'
brew 'node'
brew 'zsh'
brew 'speedtest-cli'
# need to install java before jenkins
brew 'wget'
# Casks
cask 'google-chrome'
cask 'firefox'
cask 'microsoft-edge'
cask 'visual-studio-code'
cask 'whatsapp'
cask 'skype'
cask 'slack'
cask 'spotify'
cask 'iterm2'
cask 'droplr'
cask 'rectangle'
